app/controllers/wings_controller.rb

  def index
    @wings = Wing.all
---
SELECT "wings".* FROM "wings"

  def show
    @wing = Wing.find(params[:id])
---
SELECT  "wings".* FROM "wings" WHERE "wings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]