app/views/wings/show.html.erb

SELECT "patients".* FROM "patients" INNER JOIN "patient_placements" ON "patients"."id" = "patient_placements"."patient_id" WHERE "patient_placements"."wing_id" = $1  [["wing_id", 1]]
---
  <div class="row m-5">
    <% @wing.patients.each do |patient| %>